In [1]:
import pandas as pd
import numpy as np

In [2]:
a = np.arange(10, 100, 20)
pd.Series(a)

0    10
1    30
2    50
3    70
4    90
dtype: int32

In [3]:
index = ['a', 'b', 'c', 'd', 'e']
pd.Series(a, index=index)

a    10
b    30
c    50
d    70
e    90
dtype: int32

In [4]:
dict = {'Ali':90, 'Shan':80, 'Khan':30, 'Peesho':90, 'Karim':11, 'Talha':81, 'Jawad':17, 'Manja':32}
b = pd.Series(dict)
b

Ali       90
Shan      80
Khan      30
Peesho    90
Karim     11
Talha     81
Jawad     17
Manja     32
dtype: int64

In [5]:
b.isin([90])

Ali        True
Shan      False
Khan      False
Peesho     True
Karim     False
Talha     False
Jawad     False
Manja     False
dtype: bool

In [6]:
b.head(3)

Ali     90
Shan    80
Khan    30
dtype: int64

In [7]:
b.tail(3)

Talha    81
Jawad    17
Manja    32
dtype: int64

In [8]:
ind = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
c = np.random.randint(11, 100, 10)
d = pd.Series(c, index=ind)
d

a    59
b    12
c    53
d    54
e    28
f    59
g    97
h    39
i    47
j    72
dtype: int32

In [9]:
d.sort_values()

b    12
e    28
h    39
i    47
c    53
d    54
a    59
f    59
j    72
g    97
dtype: int32

In [10]:
d.sort_index()

a    59
b    12
c    53
d    54
e    28
f    59
g    97
h    39
i    47
j    72
dtype: int32

In [11]:
ind = ['i', 'ii', 'iii', 'iv', 'v', 'vi', 'vii', 'viii', 'ix', 'x']
e = np.random.randint(11, 100, 30)
f= e.reshape(10, 3)
f

array([[82, 19, 38],
       [26, 64, 98],
       [99, 83, 87],
       [61, 69, 32],
       [22, 88, 39],
       [65, 29, 99],
       [75, 36, 94],
       [18, 71, 37],
       [30, 49, 70],
       [20, 59, 43]])

In [12]:
df = pd.DataFrame(f, index=ind, columns=['Database', 'COAL', 'OPP'])
df

      Database  COAL  OPP
i           82    19   38
ii          26    64   98
iii         99    83   87
iv          61    69   32
v           22    88   39
vi          65    29   99
vii         75    36   94
viii        18    71   37
ix          30    49   70
x           20    59   43

In [13]:
df.loc['iii':'vii']

     Database  COAL  OPP
iii        99    83   87
iv         61    69   32
v          22    88   39
vi         65    29   99
vii        75    36   94

In [14]:
df.loc['x', 'COAL']

59

In [15]:
df.iloc[2:7]

     Database  COAL  OPP
iii        99    83   87
iv         61    69   32
v          22    88   39
vi         65    29   99
vii        75    36   94

In [16]:
df.iloc[9, 1]

59

In [17]:
dfd = np.random.randint(11, 100, (10, 6))
dfd = pd.DataFrame(dfd, index="a b c d e f g h k l".split(), columns="i ii iii iv v vi".split())
dfd

    i  ii  iii  iv   v  vi
a  69  24   31  29  36  29
b  42  94   86  48  58  59
c  47  88   11  18  58  80
d  84  32   32  90  40  85
e  84  93   63  80  74  83
f  68  71   34  98  35  56
g  88  93   87  79  51  56
h  99  41   20  25  54  85
k  32  13   77  59  31  13
l  14  97   52  78  19  30

In [18]:
dfd['iv'] > 60

a    False
b    False
c    False
d     True
e     True
f     True
g     True
h    False
k    False
l     True
Name: iv, dtype: bool

In [19]:
dfd[dfd > 60]

      i    ii   iii    iv     v    vi
a  69.0   NaN   NaN   NaN   NaN   NaN
b   NaN  94.0  86.0   NaN   NaN   NaN
c   NaN  88.0   NaN   NaN   NaN  80.0
d  84.0   NaN   NaN  90.0   NaN  85.0
e  84.0  93.0  63.0  80.0  74.0  83.0
f  68.0  71.0   NaN  98.0   NaN   NaN
g  88.0  93.0  87.0  79.0   NaN   NaN
h  99.0   NaN   NaN   NaN   NaN  85.0
k   NaN   NaN  77.0   NaN   NaN   NaN
l   NaN  97.0   NaN  78.0   NaN   NaN

In [20]:
dfd[dfd['v'] > 50]

    i  ii  iii  iv   v  vi
b  42  94   86  48  58  59
c  47  88   11  18  58  80
e  84  93   63  80  74  83
g  88  93   87  79  51  56
h  99  41   20  25  54  85

In [21]:
dfd[dfd['v'] > 50]['i']

b    42
c    47
e    84
g    88
h    99
Name: i, dtype: int32